package org.example.pulldown;

public class PullDownList {
    //открыть страницу
    //прокрутить до списка вопросов
   //перейти к списку вопросов
    //основной сценарий - открывается вопрос по нажатию на стрелку
    //тест - при нажатии на стрелку открывается строка с соответствующим параметром ( там есть номера accordion__heading-2 и соответственно accordion__panel-2
    //список сответствия выношу в список тестовых данных
    //при проверке сравниваю параметр открывшегося вопроса и эталонный ответ




}

/*

элементы главной страницы https://qa-scooter.praktikum-services.ru/
кнопка Заказать в двух местах

раздел Вопросы о важном

Это MainPage, по нажатию на кнопку Заказать открывается следующая - OrderPage, на ней есть заголовок, форма заказа и кнопка "Далее"

После нажатия кнопки открывается    вторая страница - "Про аренду"  RentPage
здесь есть форма заполнения RentForm и кнопка Заказать


открывается страница подтверждения   ConfirmPage - надо нажать на кнопку Да
появится форма с результатом , надо найти кнопку "посмотреть статус"

в Хроме не нажимается кнопка на форме  подтверждения

 */